Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The methods, processElement() and processBroadcastElement(), are called with different context objects.
zh_cn: processElement()和processBroadcastElement()两个方法在调用时会传入不同的上下文对象。

source: The mode can either be PRO CESS_ONCE or PROCESS_CONTINUOUSLY.
zh_cn: 可选项为PROCESS_ONCE或PROCESS_CONTINUOUSLY。

source: The mode in which the path should be read.
zh_cn: 目标路径的读取模式。

source: The more resources available for recovery, the faster the catch-up phase completes and the faster processing latencies go back to normal.
zh_cn: 用于恢复的资源越多，追赶阶段的时长就会越短，处理延迟也就恢复得越快。

source: The most trivial way would be to simply restart the job, but then we would have to replay all data.
zh_cn: 最傻的办法就是简单地重启作业，但这样的话我们必须重放全部数据。

source: The most widely used types can be grouped into the following categories:
zh_cn: 使用最多的可以分为以下几类：

source: The naive approach to taking a checkpoint from a streaming application—to pause, checkpoint, and resume the application—is not practical for applications that have even moderate latency requirements due to its “stop-the-world” behavior.
zh_cn: 针对流式应用，生成检查点的朴素方法就是暂停执行，生成检查点，然后恢复应用。但这种"停止一切"的行为，即便对于那些具有中等延迟要求的应用也很不切实际。

source: The name for the new image
zh_cn: 新镜像的名称

source: The name that the user specifies when registering the metric
zh_cn: 用户在注册指标时指定的名称

source: The network
zh_cn: TaskManager的网络模块在传输记录前会将它们在缓冲区中收集起来，因此，记录并非逐个发送的，而是在缓冲区中以批次形式发送。

source: The network component of a TaskManager collects records in buffers before they are shipped, i.e., records are not shipped one by one but batched into buffers.
zh_cn: 它的网络模块在记录传输前会先将它们收集到缓冲区中。换言之，记录并非逐个发送的，而是在缓冲区中以批次形式发送。

source: The next block of code shows the Trigger API:
zh_cn: 以下代码块展示了Trigger的API：

source: The next example shows how to connect a (nonkeyed) DataStream with a broadcas‐ ted stream:
zh_cn: 下面的例子展示了如何联结一个（未按照键值分区的）DataStream和一个广播流：

source: The no-restart strategy does not restart an application, but fails it immediately.
zh_cn: no-restart策略不会重启应用，而是让它立即失败。

source: The null parameter of TextInputFormat in Example 8-3 defines the path that is separately set.
zh_cn: 示例8-3中TextInputFormat的null参数表示要单独设置读取路径。

source: The number of buffers depends on the total number of network connections between operator tasks.
zh_cn: 其数目取决于算子任务之间的网络连接总数。

source: The number of connections are tracked per TaskManager process and path authority
zh_cn: 连接数会以每个TaskManager进程、每个路径为单位分别追踪，

source: The number of key groups limits the maximum number of parallel tasks to which keyed state can be scaled.
zh_cn: 该数量限制了键值分区状态可以被扩展到的最大并行任务数。

source: The number of parallel tasks of an operator is called the parallelism of the operator.
zh_cn: 算子并行化任务的数目称为该算子的并行度。

source: The number of slots a TaskManager offers is controlled with the taskmanager.num berOfTaskSlots key in the configuration file.
zh_cn: TaskManager所提供的处理槽数量是由配置文件中的taskmanager.numberOfTaskSlots项来指定的。

source: The number of slots limits the number of tasks a TaskManager can execute.
zh_cn: 处理槽的数目限制了一个TaskManager可执行的任务数。

source: The number of slots limits the number of tasks that a TaskMan‐ ager can execute.
zh_cn: 处理槽的数目限制了一个TaskManager可执行的任务数。

source: The number of slots usually only needs to be configured for standalone setups as
zh_cn: 通常你只需要在独立集群模式下设置处理槽的数量，

source: The observation that data processing systems (at this point in time) could either provide fast or accurate results led to the design of the so-called Lambda architecture which is depicted in Figure 1-7.
zh_cn: 以当时的眼光看待流处理系统，快速计算和准确结果二者不可兼得，因此才有了所谓的Lambda架构，详见图1-7。

source: The observation that data processing systems (at this point in time) could either provide fast or accurate results led to the design of the so-called lambda architecture, which is depicted in Figure 1-7.
zh_cn: 以当时的眼光看待流处理系统，计算快速和结果准确二者不可兼得，因此才有了所谓的Lambda架构，见图1-7。

source: The obvious next step is to learn how to actually implement a DataStream program.
zh_cn: 接下来需要学的自然就是如何实现DataStream程序。

source: The open() and close() methods of a RichFlatMapFunction.
zh_cn: RichFlatMapFunction中的open()和close()方法。

source: The open() method is an initialization method for the rich function.
zh_cn: open()是富函数中的初始化方法。

source: The operator identifier and state name are required to be able to map the state data of a savepoint to the states of the operators of a starting application.
zh_cn: 该算子标识和状态名需要能将保存点的状态数据映射到应用启动后的算子状态上。

source: The operator is integrated with Flink’s checkpointing mecha‐
zh_cn: 这些算子会和Flink的检查点机制相结合，致力于将记录以精确一次语义写入外部系统。

source: The operator keeps the current minimum value and accordingly updates it for each incoming event.
zh_cn: 其算子会维护当前的最小值，并根据每个到来的事件去更新这个值。

source: The operator keeps the current value of the sum as its internal state and updates it every time it receives a new event.
zh_cn: 该算子以内部状态形式存储当前的累加值，并会在每次收到新事件时对其进行更新。

source: The operator needs to store the “high temperature” event in its internal state until it sees the “smoke” event or the until 10-minute time period expires.
zh_cn: 这个算子需要将"高温"事件存为内部状态，直到接下来发现"烟雾"事件或超过10分钟的有效时间。

source: The operator needs to store the “high temperature” event in its internal state, until it sees the “smoke” event or the until 10-minute time period expires.
zh_cn: 这个算子需要将"高温"事件存为内部状态，直到发现"烟雾"事件或超过10分钟的过期时间。

source: The operator pipeline
zh_cn: 图3-5中的算子所组成的流水线就满足上述需求。

source: The operator pipeline shown in Figure 3-5 fulfills these requirements.
zh_cn: 图3-5中算子所组成的流水线就满足上述条件。

source: The operator plan of the application
zh_cn: 应用的算子计划（operator plan）

source: The operators are assigned to three slot-
zh_cn: 它们分别被分配到处理槽共享组green，yellow和blue中。

source: The options are ignored if the sink emits tuples, case classes, or rows.
zh_cn: 如果是写元组、样例类或Row的情况，这些选项将被忽略。

source: The order in which the broadcasted events arrive at the different parallel tasks of the broadcast state operator might differ if the operator that emits the broadcasted messages runs with a parallel‐ ism larger than 1.
zh_cn: 如果发出广播消息的算子并行度大于1，那么广播事件到达广播状态算子不同并行任务的顺序可能会不同。

source: The ordering guarantee is limited to a partition—Kafka does not provide ordering guarantees when reading from different partitions.
zh_cn: 但这样的话就只能针对某个分区实现保序，即它不能够保证不同分区间的事件顺序。

source: The org.apache.flink.metrics.Meter interface pro‐ vides methods to mark the occurrence of one or more events, get the current rate
zh_cn: org.apache.flink.metrics.Meter接口提供的方法可用于标记一个或多个事件发生、获取每秒事件发生的速率以及获取当前meter标记的事件数目。

source: The original goals of this architecture were to improve the high result latency of the original batch analytics architecture.
zh_cn: 它的最初目标是改善原始批量分析架构中结果的高延迟问题，

source: The other common case of periodic watermark generation is when you know the maximum lateness that you will encounter in the input stream—the maximum differ‐ ence between an element’s timestamp and the largest timestamp of all perviously
zh_cn: 另一个周期性生成水位线的常见情况是，你知道输入流中的延迟（任意新到元素和已到时间戳最大元素之间的时间差）上限。

source: The other operators have a parallelism of four.
zh_cn: 其余算子的并行度为4。

source: The other oper‐ ators have a parallelism of four.
zh_cn: 其余算子的并行度为4。

source: The output can be read as follows: the first field of the SensorReading is a sen‐ sorId, the second field is the timestamp as milliseconds since 1970-01-01-00:00:00.000, and the third field is an average temperature compu‐ ted over five seconds.
zh_cn: 输出说明如下：SensorReading的第一个字段是sensorId，第二个字段是以距1970-01-01-00:00:00.000的毫秒数表示的时间戳，第三个字段是每隔5秒计算出的平均温度。

source: The output is only eventually consistent, because results are reset to a previous version during recovery, meaning consumers might read older results than read previously.
zh_cn: 之所以如此，是因为在恢复期间写出的结果会被重置到以前的版本。这意味着后续的消费者可能会读到比之前读取的值更旧的结果。

source: The output of the example is (1,2,2) followed by (1,7,2) for the key “1” and (2,3,1) followed by (2,5,1) for the key “2.” The first
zh_cn: 示例对于键值"1"首先输出(1,2,2)，然后是(1,7,2)；对于键值"2"首先输出(2,3,1)，然后是(2,5,1)。

source: The output of the job is written to the standard out of Flink’s worker process which is by default redirected into a file in the ./log folder.
zh_cn: 作业的输出会写入Flink工作进程的标准输出，默认情况下它会重定向到./log目录下的文件。

source: The output of the job is written to the standard out of Flink’s worker process, which is redirected into a file in the ./log folder by default.
zh_cn: 作业的输出会写入Flink工作进程的标准输出，默认情况下它会重定向到./log目录下的文件。

source: The output of the program is written to the standard out (or console) window of your IDE.
zh_cn: 程序的输出会写到你IDE的标准输出（或控制台）窗口。

source: The output of the source tasks is partitioned into streams of even and odd numbers.
zh_cn: 数据源任务的输出会被分成奇数流和偶数流两个部分，

source: The output starts with a few log statements about the states that parallel operator tasks go through, such as SCHED‐ ULING, DEPLOYING, and RUNNING.
zh_cn: 输出以几行日志语句开始，它们记录了并行算子所经过的一系列状态，例如：SCHEDULING、DEPLOYING以及RUNNING。

source: The overall logic is the same, but instead of calling a JoinFunction for every pair of events from both inputs, a CoGroupFunction is called once per window with iterators over the elements from both inputs.
zh_cn: Join和Cogroup的总体逻辑相同，二者的唯一区别是：Join会为两侧输入中的每个事件对调用JoinFunction；而Gogroup中用到的GoGroupFunction会以两个输入的元素遍历器为参数，只在每个窗口中被调用一次。

source: The parallelism of an operator can be controlled at the level of the execution environ‐ ment or per individual operator.
zh_cn: 算子的并行度可以在执行环境级别或单个算子级别进行控制。

source: The parallelism of the environment (and thus also the default parallelism of all operators) is automatically initialized based on the context in which the application is started.
zh_cn: 而环境的并行度（即所有算子的默认并行度）则会根据应用启动时所处的上下文自动初始化。

source: The parameter -m defines the host to which the job is submitted.
zh_cn: 参数-m用来定义提交作业的目标主机。

source: The parameter is ignored in PROCESS_ONCE mode.
zh_cn: 如果选择PROCESS_ONCE，该参数会被忽略。

source: The path of a part file has the fol‐
zh_cn: 这些文件的路径遵循以下规则：

source: The path that should be read.
zh_cn: 要读取的目标路径。

source: The performance of a stateful operator (built-in or user-defined) depends on several aspects, including the data types of the state, the state backend of the application, and the chosen state primitives.
zh_cn: 状态化算子（无论是内置的还是用户自定义的）的性能取决于多个方面，包括状态的数据类型，应用的状态后端以及所选的状态原语。

source: The pom.xml file of a generated Maven project contains comments that explain how to add additional dependencies.
zh_cn: 所生成Maven项目中的pom.xml文件包含了教你如何添加额外依赖的注释。

source: The port also exposes Flink’s REST API.
zh_cn: 它的端口同样是Flink REST API的端口。

source: The ports used by the client proxy and server and additional parameters can be con‐ figured in the ./conf/flink-conf.yaml file.
zh_cn: 客户端代理和服务器所使用的端口以及一些额外的参数可以在./conf/flink-conf.yaml文件中配置。

source: The possible TriggerResult values enable you to implement sophisticated window‐ ing logic.
zh_cn: 多样化的TriggerResult返回值可以让你实现复杂的窗口逻辑。

source: The previous chapter discussed important concepts of distributed stream processing, such as parallelization, time, and state.
zh_cn: 上一章主要讨论了分布式流处理中的一些重要概念，例如：并行、时间、状态等。

source: The previous chapter introduced two concepts Flink leverages to provide event-time semantics: record timestamps and watermarks.
zh_cn: 上一章我们介绍了Flink在提供处理时间语义时所采用的两个概念：记录时间戳和水位线。

source: The previous chapter introduced two concepts that Flink leverages to pro‐ vide event-time semantics: record timestamps and watermarks.
zh_cn: 上一章介绍了Flink在提供处理时间语义时所采用的两个概念：记录时间戳和水位线。

source: The problem is that Alice lives in Berlin and she takes the subway to work.
zh_cn: 但问题在于，爱丽丝住在柏林，每天乘地铁上班，

source: The problem is that Alice lives in Berlin and takes the subway to work.
zh_cn: 然而有个问题：爱丽丝住在柏林，每天乘地铁上班，

source: The problem is that Minikube tries to fetch the custom image from a public Docker image registry instead of the local Docker registry of your machine.
zh_cn: 主要问题是Minikube会尝试从公共Docker镜像注册表而不是本地机器的Docker注册表获取自定义镜像。

source: The process of copying data to the data warehouse is called extract-transform-load (ETL).
zh_cn: 这个向数据仓库拷贝数据的过程被称为提取-转换-加载（Extract-Transform-Load，ETL）。

source: The process of copying data to the data warehouse is called extract–transform–load (ETL).
zh_cn: 这个向数据仓库拷贝数据的过程被称为提取-转换-加载（Extract-Transform-Load，ETL）。

source: The process of waiting for all barriers to arrive is called barrier alignment, and it is depicted in Figure 3-22.
zh_cn: 这个等待所有分隔符到达的过程称为分隔符对齐，我们在图3-22中对它进行了展示。

source: The process() method is called with the key of the window, an Iterable to access the elements of the window, and a Collector to emit results.
zh_cn: process()方法在被调用时会传入窗口的键值、一个用于访问窗口内元素的Iterator以及一个用于发出结果的Collector。

source: The processElement() and onTimer() methods are synchronized to prevent concurrent access and manipu‐ lation of state.
zh_cn: processElement()和onTimer()两个方法是做了同步的，这样可以防止并发访问或操作状态。

source: The program fails while a task is running the sendValues() method.
zh_cn: 程序在任务运行sendValues()方法时发生故障。

source: The program in Example 5-1 converts the temperatures from Fahrenheit to Celsius and computes the average temperature every 5 seconds for each sensor.
zh_cn: 示例5-1中的程序将温度从华氏度转为摄氏度并计算每个传感器每5秒的平均温度。

source: The program will continue to generate new events, process them, and emit new results every second until you terminate it.
zh_cn: 如果不手动终止，这个程序会不停生成新的事件、对它们进行处理并每秒产生新的结果。

source: The project contains two skeleton files, BatchJob.scala and StreamingJob.scala, as a starting point for your own programs.
zh_cn: 你可以使用项目生成的两个框架文件，BatchJob.scala和StreamingJob.scala，作为你程序的起点。

source: The protocol and the requirements of the sink system might be easier to understand by looking at a concrete example.
zh_cn: 为了理解数据汇系统的协议和需求，我们来看一个具体的示例。

source: The purpose of checkpoints is to recover an application after a failure.
zh_cn: 检查点的目的是用于应用故障恢复。

source: The random data exchange strategy is implemented by the DataStream.shuf fle() method.
zh_cn: 我们可以利用DataStream.shuffle()方法实现随机数据交换策略。

source: The rapid digitalization and emergence of connected systems made it possible to collect much more data in real-time and immediately act on this data for example by adjusting to changing conditions or by personalizing user experiences.
zh_cn: 数字化的迅猛发展和互联系统的出现使得我们可以实时获取更多数据并立即根据它们采取行动，例如：适应状况的变化或个性化用户体验。

source: The reading position in a Kafka partition is called an offset.
zh_cn: Kafka中分区的读取位置称为偏移（offset）。

source: The reason for this is to keep the number of default dependencies low.4 Most connec‐ tors and libraries rely on one or more libraries, which typically have several addi‐ tional transitive dependencies.
zh_cn: 之所以这么做是为了保持默认依赖的简洁性，4 因为大多数连接器或库还需要依赖其他库，而这些库通常又会级联引用更多的依赖。

source: The reason is that proxy services offer more authentication and configuration options than Flink.
zh_cn: 其原因在于代理服务和Flink相比，提供了更多的身份验证及配置选项。

source: The rebalance() method partitions the input stream so that events are evenly distributed to successor tasks in a round-robin fashion.
zh_cn: rebalance()方法会将输入流中的事件以轮流方式均匀分配给后继任务，

source: The receiver processes the shipped data with the reserved buffers and uses the sender’s backlog size to prioritize the next credit grants for all its connected senders.
zh_cn: 接收端使用保留的缓冲来处理收到的数据，同时依据各发送端的积压量信息来计算所有相连的发送端在下一轮的信用优先级。

source: The receiving task takes the buffer from the queue and deserializes the incoming records.
zh_cn: 接收任务会从这个队列里获取缓冲区并将其中的记录反序列化。

source: The reduce transformation is a generalization of the rolling aggregation.
zh_cn: reduce转换是滚动聚合转换的泛化。

source: The relevant configu‐ ration keys are:
zh_cn: 相关配置的键是：

source: The remote storage for checkpointing could be a distributed filesystem or a database system.
zh_cn: 该远程存储可能是一个分布式文件系统，也可能是某个数据库系统。

source: The rescale transformation is more efficient if the number of receiver tasks is a multitude of the number of sender tasks or vice versa.
zh_cn: 当接收端任务远大于发送端任务的时候，该方法会更有效，反之亦然。

source: The rescale() method also distributes events in a round-robin fashion, but only to a subset of successor tasks.
zh_cn: rescale()也会以轮流方式对事件进行分发，但分发目标仅限于部分后继任务。

source: The rest of the Flink ecosystem
zh_cn: Flink生态的其他组成部分

source: The restart strategy of an application is configured via StreamExecutionEnvironment
zh_cn: 你可以像示例10-4那样使用StreamExecutionEnvironment配置应用重启策略。

source: The restoreState() method is always invoked when the state of a function needs to be initialized—when the job is started (from a savepoint or not) or in the case of a
zh_cn: restoreState()方法会在初始化函数状态时调用，该过程可能发生在作业启动（无论是否从保存点）或故障恢复的情况下。

source: The result data has a deterministic (composite) key, on which idempotent updates can be performed.
zh_cn: 结果数据中用于幂等更新的（复合）键值是确定的。

source: The result stream is written to the standard output by calling print():
zh_cn: 我们通过调用print()方法将结果写到标准输出：

source: The results of the program are emitted to standard output.
zh_cn: 程序的结果会写入标准输出。

source: The rolling aggregate operator keeps a state for every key that is processed.
zh_cn: 滚动聚合算子会为每个处理过的键值维持一个状态。

source: The rolling reduce operator keeps a state for every key that is pro‐ cessed.
zh_cn: 滚动reduce算子会为每个处理过的键值维持一个状态。

source: The run() method is called once by Flink and runs in a dedicated source thread, typically reading or receiving data
zh_cn: run()方法只会在Flink中调用一次，后者会专门为它开一个的线程，该线程通常会循环读取或接收数据并将它们发出（无限流）。

source: The run() method is doing the actual work of reading or receiving records and ingesting them into a Flink application.
zh_cn: run()方法负责执行具体记录读入或接收工作，它会将这些记录传入Flink应用中。

source: The script is included in the source distribution and Flink’s Git repository.
zh_cn: 你可以从源码发行版或Flink的Git仓库中找到它，

source: The script requires the fol‐ lowing parameters:
zh_cn: 脚本所需参数如下：

source: The script will start a local JobManager and start one TaskMan‐ ager for each entry in the slaves file.
zh_cn: 该脚本会在本地启用一个JobManager，并针对slaves文件中的每一个条目启动一个TaskManager。

source: The second approach to achieve end-to-end exactly-once consistency is based on transactional writes.
zh_cn: 实现端到端精确一次一致性的第二个途径是事务性写。

source: The second argument is a DeserializationSchema or KeyedDeserialization Schema.
zh_cn: 第二个参数是一个DeserializationSchema或KeyedDeserializationSchema。

source: The second is the name of the
zh_cn: 第二个参数是数据写入的目标主题。

source: The second property is used to handle streams with out-of-order record timestamps, such as the records with timestamps 3 and 5 in Figure 3-8.
zh_cn: 第二个属性是用来应对那些记录时间戳乱序的数据流，例如图3-8中所示的时间戳3和5。

source: The second step of a FileInputFormat is to receive an
zh_cn: FileInputFormat读取过程的第二步是接收一个输入划分，

source: The second type are ad-hoc queries that aim to provide answers to specific questions and support business-critical deci‐ sions.
zh_cn: 第二类是即席查询，其主要目的是通过解答特定问题来辅助商业决策。

source: The second type are ad-hoc queries that aim to provide answers to specific questions and support business-critical decisions, for example a query to collect revenue numbers and spending on radio commercials to evaluate the effectiveness of a marketing cam‐ paign.
zh_cn: 第二类是即席查询（ad-hoc query）。其主要目的是通过解答特定问题来辅助关键性的商业决策，例如：通过查询来整合营收数字和电台广告中的投入，以评估市场营销的有效性。

source: The serialization format of state is an important aspect when updating an application and is discussed later in this chapter.
zh_cn: 状态的序列化格式是在更新应用时需要重点考虑的一个方面，我们将在本章稍后对此进行讨论。

source: The serializer is also used to convert the raw bytes back into JVM objects.
zh_cn: 该序列化器还用于将原始字节转换回JVM对象。

source: The serializers that convert the state JVM objects into bytes are generated and configured by Flink’s type system.
zh_cn: 用于转换JVM中状态对象的序列化器是由Flink的类型系统生成和配置的。

source: The service can be a Flink Dispatcher, a Flink JobManager, or YARN’s ResourceManager.
zh_cn: 此处的服务可以是Flink Dispatcher，Flink JobManager或是YARN的ResourceManager。

source: The service can be a Flink Dispatcher, a Flink Job‐ Manager, or YARN’s ResourceManager.
zh_cn: 这里的服务可以是Flink Dispatcher，Flink JobManager或是YARN的ResourceManager。

source: The service defi‐ nition that exposes the master process and makes it accessible to the worker contain‐ ers is shown in Example 9-4.
zh_cn: 示例9-4中展示的Service定义会将主进程暴露出来以供工作进程容器访问。

source: The service latency is the time you spend in the coffee shop, from the moment you enter until you have your first sip of coffee.
zh_cn: 所谓服务延迟就是你在店内买咖啡的时间，即从你进门的一刻到抿到第一口咖啡的时间。

source: The session is stopped and all resources are freed when the script is terminated.
zh_cn: 在脚本终止时，会话就会停止，一切资源得以释放。

source: The session mode starts a long-running Flink cluster that can run multiple jobs and needs to be manually stopped.
zh_cn: 而在会话模式下，系统会启动一个长时间运行的Flink集群，该集群可以运行多个作业，需要我们手动停止。

source: The simplest thing to do when a task fails is to do nothing to recover lost state and replay lost events.
zh_cn: 任务发生故障时最简单的措施就是既不恢复丢失的状态，也不重放丢失的事件。

source: The simplest way to get an overview of your Flink cluster as well as a glimpse of what your jobs are doing internally is to use Flink’s Web UI.
zh_cn: 了解Flink集群和内部作业工作情况概要最简单的方法就是使用Flink Web UI。

source: The sink achieves this by a commit protocol that moves files through different stages, in progress, pending,
zh_cn: 它的实现方式是采用一种提交协议，该协议会基于Flink的检查点机制将文件在不同阶段（进行，等待及完成）间转移。

source: The sink commits a transaction when it receives the completion notifica‐ tion of the corresponding checkpoint.
zh_cn: 数据汇在接收到对应检查点的完成通知后才会提交事务。

source: The sink connector throws an exception if a write does not succeed, causing the application to fail and recover.
zh_cn: 如果数据汇连接器写入不成功，则会抛出异常，继而导致应用失败并进行故障恢复。

source: The sink connector waits for Kafka to acknowledge in-flight records before com‐ pleting its checkpoint.
zh_cn: 数据汇连接器要在检查点完成前等待kafka确认记录写入完毕。

source: The sink in Example 8-15 appends the value as a String to the transaction file.
zh_cn: 示例8-15中的数据汇将传入值以String形式写到事务文件中。

source: The sink must be able to recover a transaction after a process failed.
zh_cn: 数据汇需要在进程发生故障时进行事务恢复。

source: The sink task also starts a new transaction for all records that arrive before the next checkpoint barrier.
zh_cn: 而同时，它还会为在下一个检查点分隔符之前到来的所有记录开启一个新的事务。

source: The sink task must not yet commit the transac‐ tion, because it is not guaranteed that all tasks of the job will complete their check‐ points.
zh_cn: 由于数据汇任务此时还不能保证所有作业任务都可以顺利完成检查点工作，所以它暂时无法提交事务，

source: The slide value defines the interval at which a new bucket is created.
zh_cn: 滑动间隔决定每隔多久生成一个新的桶。

source: The sliding count-based window of Figure 2-8 has a length of 4 events and slide of 3 events.
zh_cn: 在图2-8中，基于数量的滑动窗口的长度为4个事件，滑动间隔为3个事件。

source: The sliding count-based window of Figure 2-8 has a length of four events and slide of three events.
zh_cn: 在图2-8中，基于数量的滑动窗口的长度为4个事件，滑动间隔为3个事件。

source: The sliding window assigner assigns elements to fixed-sized windows that are shifted by a specified slide interval, as shown in Figure 6-2.
zh_cn: 如图6-2所示，滑动窗口分配器将元素分配给大小固定且按指定滑动间隔移动的窗口。

source: The snapshot State() method splits the operator state into multiple parts and the restoreState()
zh_cn: snapshotState()方法能够将算子状态分为多个部分，

source: The snapshotState() method is called immediately before a checkpoint is taken and receives a FunctionSnapshotContext object as the parameter.
zh_cn: snapshotState()方法会在生成检查点之前调用，它需要接收一个FunctionSnapshotContext对象作为参数。

source: The snapshotState() method is invoked when Flink triggers a checkpoint of the stateful function.
zh_cn: snapshotState()方法会在Flink触发为状态化函数生成检查点时调用。

source: The source is automatically set as active as soon as it starts to emit records again.
zh_cn: 数据源一旦开始接收记录，就会恢复活动状态。

source: The source task stores the current offset of its input stream as state.
zh_cn: 数据源算子的任务会把输入流的当前偏移量存为状态；

source: The src/ folder has the follow‐ ing structure:
zh_cn: src/目录的结构如下：

source: The standard Flink Docker images are a good starting point to customize your own Flink images.
zh_cn: 标准的Flink Docker镜像可以帮助你快速上手定制自己的Flink镜像。

source: The start scripts must be able to start a Java process.
zh_cn: 但前提是启动脚本可以启动Java进程。

source: The start-cluster.sh script requires a passwordless SSH configuration on all machines to be able to start the TaskManager processes.
zh_cn: start-cluster.sh脚本需要针对所有运行TaskManager进程的机器配置无密码SSH登录。
